tap 'github/gh'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'homebrew/services'

#install 
brew 'mas'

# app store
mas 'Xcode', id: 497799835
mas 'Magnet', id: 441258766

brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'bat'
brew 'curl'
brew 'dive'
brew 'fish'
brew 'gh'
brew 'git'
brew 'hub'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'openssl'
brew 'python3'
brew 'ruby'
brew 'shellcheck'
brew 'terraform'
brew 'vim'
brew 'wget'
brew 'yamllint'
brew 'yarn'
brew 'zsh'

# apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'figma'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'notion'
cask 'slack'
cask 'visual-studio-code'
cask 'zoomus'


# fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cast 'font-space-grotesk'

